# 运算符           python表达式               结果              描述              支持数据类型
# +               [1, 2] + [3, 4]         [1, 2, 3, 4]      合并              字符串、列表、元组
# *               [1, 2]*2                [1, 2, 1, 2]      重复              字符串、列表、元组
# in              3 in (1, 2,3)           True              元素是否存在       字符串、列表、元组、字典
# not in          4 not in (1, 2, 3)      True              元素是否不存在     字符串、列表、元组、字典
# > >= == < <=    (1, 2, 6) < (1, 3, 4)   True              元素比较（按位比）        字符串、列表、元组

